import * as echarts from 'echarts';
import { RadarChart} from 'echarts/charts';
import { TitleComponent,TooltipComponent,LegendComponent } from 'echarts/components';
import { CanvasRenderer } from 'echarts/renderers';
import { da } from 'element-plus/es/locales.mjs';


export type EChartsOption = echarts.EChartsOption;

export const initEChart = (chartDom: HTMLElement) => {
  var myChart = echarts.init(chartDom);
  var option: EChartsOption;
// prettier-ignore
const RentData = [[161.2, 51.6], [167.5, 59.0], [159.5, 49.2], [157.0, 63.0], [155.8, 53.6],
    [170.0, 59.0], [159.1, 47.6], [166.0, 69.8], [176.2, 66.8], [160.2, 75.2],
    [172.5, 55.2], [170.9, 54.2], [172.9, 62.5], [153.4, 42.0], [160.0, 50.0],
    [147.2, 49.8], [168.2, 49.2], [175.0, 73.2], [157.0, 47.8], [167.6, 68.8],
    [159.5, 50.6], [175.0, 82.5], [166.8, 57.2], [176.5, 87.8], [170.2, 72.8],
    [174.0, 54.5], [173.0, 59.8], [179.9, 67.3], [170.5, 67.8], [160.0, 47.0],
    [154.4, 46.2], [162.0, 55.0], [176.5, 83.0], [160.0, 54.4], [152.0, 45.8],
    [162.1, 53.6], [170.0, 73.2], [160.2, 52.1], [161.3, 67.9], [166.4, 56.6],
    [168.9, 62.3], [163.8, 58.5], [167.6, 54.5], [160.0, 50.2], [161.3, 60.3],
    [167.6, 58.3], [165.1, 56.2], [160.0, 50.2], [170.0, 72.9], [157.5, 59.8],
    [167.6, 61.0], [160.7, 69.1], [163.2, 55.9], [152.4, 46.5], [157.5, 54.3],
    [168.3, 54.8], [180.3, 60.7], [165.5, 60.0], [165.0, 62.0], [164.5, 60.3],
    [156.0, 52.7], [160.0, 74.3], [163.0, 62.0], [165.7, 73.1], [161.0, 80.0],
    [162.0, 54.7], [166.0, 53.2], [174.0, 75.7], [172.7, 61.1], [167.6, 55.7],
    [151.1, 48.7], [164.5, 52.3], [163.5, 50.0], [152.0, 59.3], [169.0, 62.5],
    [164.0, 55.7], [161.2, 54.8], [155.0, 45.9], [170.0, 70.6], [176.2, 67.2],
    [170.0, 69.4], [162.5, 58.2], [170.3, 64.8], [164.1, 71.6], [169.5, 52.8],
    [163.2, 59.8], [154.5, 49.0], [159.8, 50.0], [173.2, 69.2], [170.0, 55.9],
    [161.4, 63.4], [169.0, 58.2], [166.2, 58.6], [159.4, 45.7], [162.5, 52.2],
    [159.0, 48.6], [162.8, 57.8], [159.0, 55.6], [179.8, 66.8], [162.9, 59.4],
    [161.0, 53.6], [151.1, 73.2], [168.2, 53.4], [168.9, 69.0], [173.2, 58.4],
    [171.8, 56.2], [178.0, 70.6], [164.3, 59.8], [163.0, 72.0], [168.5, 65.2],
    [166.8, 56.6], [172.7, 105.2], [163.5, 51.8], [169.4, 63.4], [167.8, 59.0],
    [159.5, 47.6], [167.6, 63.0], [161.2, 55.2], [160.0, 45.0], [163.2, 54.0],
    [162.2, 50.2], [161.3, 60.2], [149.5, 44.8], [157.5, 58.8], [163.2, 56.4],
    [172.7, 62.0], [155.0, 49.2], [156.5, 67.2], [164.0, 53.8], [160.9, 54.4],
    [162.8, 58.0], [167.0, 59.8], [160.0, 54.8], [160.0, 43.2], [168.9, 60.5],
    [158.2, 46.4], [156.0, 64.4], [160.0, 48.8], [167.1, 62.2], [158.0, 55.5],
    [167.6, 57.8], [156.0, 54.6], [162.1, 59.2], [173.4, 52.7], [159.8, 53.2],
    [170.5, 64.5], [159.2, 51.8], [157.5, 56.0], [161.3, 63.6], [162.6, 63.2],
    [160.0, 59.5], [168.9, 56.8], [165.1, 64.1], [162.6, 50.0], [165.1, 72.3],
    [166.4, 55.0], [160.0, 55.9], [152.4, 60.4], [170.2, 69.1], [162.6, 84.5],
    [170.2, 55.9], [158.8, 55.5], [172.7, 69.5], [167.6, 76.4], [162.6, 61.4],
    [167.6, 65.9], [156.2, 58.6], [175.2, 66.8], [172.1, 56.6], [162.6, 58.6],
    [160.0, 55.9], [165.1, 59.1], [182.9, 81.8], [166.4, 70.7], [165.1, 56.8],
    [177.8, 60.0], [165.1, 58.2], [175.3, 72.7], [154.9, 54.1], [158.8, 49.1],
    [172.7, 75.9], [168.9, 55.0], [161.3, 57.3], [167.6, 55.0], [165.1, 65.5],
    [175.3, 65.5], [157.5, 48.6], [163.8, 58.6], [167.6, 63.6], [165.1, 55.2],
    [165.1, 62.7], [168.9, 56.6], [162.6, 53.9], [164.5, 63.2], [176.5, 73.6],
    [168.9, 62.0], [175.3, 63.6], [159.4, 53.2], [160.0, 53.4], [170.2, 55.0],
    [162.6, 70.5], [167.6, 54.5], [162.6, 54.5], [160.7, 55.9], [160.0, 59.0],
    [157.5, 63.6], [162.6, 54.5], [152.4, 47.3], [170.2, 67.7], [165.1, 80.9],
    [172.7, 70.5], [165.1, 60.9], [170.2, 63.6], [170.2, 54.5], [170.2, 59.1],
    [161.3, 70.5], [167.6, 52.7], [167.6, 62.7], [165.1, 86.3], [162.6, 66.4],
    [152.4, 67.3], [168.9, 63.0], [170.2, 73.6], [175.2, 62.3], [175.2, 57.7],
    [160.0, 55.4], [165.1, 104.1], [174.0, 55.5], [170.2, 77.3], [160.0, 80.5],
    [167.6, 64.5], [167.6, 72.3], [167.6, 61.4], [154.9, 58.2], [162.6, 81.8],
    [175.3, 63.6], [171.4, 53.4], [157.5, 54.5], [165.1, 53.6], [160.0, 60.0],
    [174.0, 73.6], [162.6, 61.4], [174.0, 55.5], [162.6, 63.6], [161.3, 60.9],
    [156.2, 60.0], [149.9, 46.8], [169.5, 57.3], [160.0, 64.1], [175.3, 63.6],
    [169.5, 67.3], [160.0, 75.5], [172.7, 68.2], [162.6, 61.4], [157.5, 76.8],
    [176.5, 71.8], [164.4, 55.5], [160.7, 48.6], [174.0, 66.4], [163.8, 67.3]
];

// prettier-ignore
const BuyDeta = [[174.0, 65.6], [175.3, 71.8], [193.5, 80.7], [186.5, 72.6], [187.2, 78.8],
    [181.5, 74.8], [184.0, 86.4], [184.5, 78.4], [175.0, 62.0], [184.0, 81.6],
    [180.0, 76.6], [177.8, 83.6], [192.0, 90.0], [176.0, 74.6], [174.0, 71.0],
    [184.0, 79.6], [192.7, 93.8], [171.5, 70.0], [173.0, 72.4], [176.0, 85.9],
    [176.0, 78.8], [180.5, 77.8], [172.7, 66.2], [176.0, 86.4], [173.5, 81.8],
    [178.0, 89.6], [180.3, 82.8], [180.3, 76.4], [164.5, 63.2], [173.0, 60.9],
    [183.5, 74.8], [175.5, 70.0], [188.0, 72.4], [189.2, 84.1], [172.8, 69.1],
    [170.0, 59.5], [182.0, 67.2], [170.0, 61.3], [177.8, 68.6], [184.2, 80.1],
    [186.7, 87.8], [171.4, 84.7], [172.7, 73.4], [175.3, 72.1], [180.3, 82.6],
    [182.9, 88.7], [188.0, 84.1], [177.2, 94.1], [172.1, 74.9], [167.0, 59.1],
    [169.5, 75.6], [174.0, 86.2], [172.7, 75.3], [182.2, 87.1], [164.1, 55.2],
    [163.0, 57.0], [171.5, 61.4], [184.2, 76.8], [174.0, 86.8], [174.0, 72.2],
    [177.0, 71.6], [186.0, 84.8], [167.0, 68.2], [171.8, 66.1], [182.0, 72.0],
    [167.0, 64.6], [177.8, 74.8], [164.5, 70.0], [192.0, 101.6], [175.5, 63.2],
    [171.2, 79.1], [181.6, 78.9], [167.4, 67.7], [181.1, 66.0], [177.0, 68.2],
    [174.5, 63.9], [177.5, 72.0], [170.5, 56.8], [182.4, 74.5], [197.1, 90.9],
    [180.1, 93.0], [175.5, 80.9], [180.6, 72.7], [184.4, 68.0], [175.5, 70.9],
    [180.6, 72.5], [177.0, 72.5], [177.1, 83.4], [181.6, 75.5], [176.5, 73.0],
    [175.0, 70.2], [174.0, 73.4], [165.1, 70.5], [177.0, 68.9], [192.0, 102.3],
    [176.5, 68.4], [169.4, 65.9], [182.1, 75.7], [179.8, 84.5], [175.3, 87.7],
    [184.9, 86.4], [177.3, 73.2], [167.4, 53.9], [178.1, 72.0], [168.9, 55.5],
    [157.2, 58.4], [180.3, 83.2], [170.2, 72.7], [177.8, 64.1], [172.7, 72.3],
    [165.1, 65.0], [186.7, 86.4], [165.1, 65.0], [174.0, 88.6], [175.3, 84.1],
    [185.4, 66.8], [177.8, 75.5], [180.3, 93.2], [180.3, 82.7], [177.8, 58.0],
    [177.8, 79.5], [177.8, 78.6], [177.8, 71.8], [177.8, 116.4], [163.8, 72.2],
    [188.0, 83.6], [198.1, 85.5], [175.3, 90.9], [166.4, 85.9], [190.5, 89.1],
    [166.4, 75.0], [177.8, 77.7], [179.7, 86.4], [172.7, 90.9], [190.5, 73.6],
    [185.4, 76.4], [168.9, 69.1], [167.6, 84.5], [175.3, 64.5], [170.2, 69.1],
    [190.5, 108.6], [177.8, 86.4], [190.5, 80.9], [177.8, 87.7], [184.2, 94.5],
    [176.5, 80.2], [177.8, 72.0], [180.3, 71.4], [171.4, 72.7], [172.7, 84.1],
    [172.7, 76.8], [177.8, 63.6], [177.8, 80.9], [182.9, 80.9], [170.2, 85.5],
    [167.6, 68.6], [175.3, 67.7], [165.1, 66.4], [185.4, 102.3], [181.6, 70.5],
    [172.7, 95.9], [190.5, 84.1], [179.1, 87.3], [175.3, 71.8], [170.2, 65.9],
    [193.0, 95.9], [171.4, 91.4], [177.8, 81.8], [177.8, 96.8], [167.6, 69.1],
    [167.6, 82.7], [180.3, 75.5], [182.9, 79.5], [176.5, 73.6], [186.7, 91.8],
    [188.0, 84.1], [188.0, 85.9], [177.8, 81.8], [174.0, 82.5], [177.8, 80.5],
    [171.4, 70.0], [185.4, 81.8], [185.4, 84.1], [188.0, 90.5], [188.0, 91.4],
    [182.9, 89.1], [176.5, 85.0], [175.3, 69.1], [175.3, 73.6], [188.0, 80.5],
    [188.0, 82.7], [175.3, 86.4], [170.5, 67.7], [179.1, 92.7], [177.8, 93.6],
    [175.3, 70.9], [182.9, 75.0], [170.8, 93.2], [188.0, 93.2], [180.3, 77.7],
    [177.8, 61.4], [185.4, 94.1], [168.9, 75.0], [185.4, 83.6], [180.3, 85.5],
    [174.0, 73.9], [167.6, 66.8], [182.9, 87.3], [160.0, 72.3], [180.3, 88.6],
    [167.6, 75.5], [186.7, 101.4], [175.3, 91.1], [175.3, 67.3], [175.9, 77.7],
    [175.3, 81.8], [179.1, 75.5], [181.6, 84.5], [177.8, 76.6], [182.9, 85.0],
    [177.8, 102.5], [184.2, 77.3], [179.1, 71.8], [176.5, 87.9], [188.0, 94.3],
    [174.0, 70.9], [167.6, 64.5], [170.2, 77.3], [167.6, 72.3], [188.0, 87.3],
    [174.0, 80.0], [176.5, 82.3], [180.3, 73.6], [167.6, 74.1], [188.0, 85.9],
    [180.3, 73.2], [167.6, 76.3], [183.0, 65.9], [183.0, 90.9], [179.1, 89.1],
    [170.2, 62.3], [177.8, 82.7], [179.1, 79.1], [190.5, 98.2], [177.8, 84.1],
    [180.3, 83.2], [180.3, 83.2]
];

function calculateAverage(data: number[][], dim: number) {
  let total = 0;
  for (var i = 0; i < data.length; i++) {
    total += data[i][dim];
  }
  return (total /= data.length);
}

const scatterOption: echarts.EChartsOption = (option = {
  xAxis: {
    scale: true
  },
  yAxis: {
    scale: true
  },
  series: [
    {
      type: 'scatter',
      id: '租赁',
      itemStyle:{
        color:'rgba(10,193,199)',
      },
      dataGroupId: '租赁',
      universalTransition: {
        enabled: true,
        delay: function (idx, count) {
          return Math.random() * 400;
        }
      },
      data: RentData
    },
    {
      type: 'scatter',
      id: '购买',
      itemStyle:{
        color:'#f29701',
      },
      dataGroupId: '购买',
      universalTransition: {
        enabled: true,
        delay: function (idx, count) {
          return Math.random() * 400;
        }
      },
      data: BuyDeta
    }
  ]
});

const barOption: echarts.EChartsOption = {
  xAxis: {
    type: 'category',
    data: ['租赁', '购买']
  },
  yAxis: {},
  series: [
    {
      type: 'bar',
      id: 'total',
      data: [
        {
          value: calculateAverage(RentData, 0),
          groupId: '租赁'
        },
        {
          value: calculateAverage(BuyDeta, 0),
          groupId: '购买'
        }
      ],
      universalTransition: {
        enabled: true,
        seriesKey: ['租赁', '购买'],
        delay: function (idx, count) {
          return Math.random() * 400;
        }
      }
    }
  ]
};

let currentOption = scatterOption;

setInterval(function () {
  currentOption = currentOption === scatterOption ? barOption : scatterOption;
  myChart.setOption(currentOption, true);
}, 5000);

option && myChart.setOption(option);
}

//echarts2
export const InitChart2=(chartDom:HTMLElement)=>{
  const myChart = echarts.init(chartDom);
  const lineStyle={
    width:1,
    opacity:0.5
  };

  const option: echarts.EChartsOption = {
    // 从这里开始粘贴您的ECharts配置项
    backgroundColor: 'rgba(10,193,199,0.1)',
    title: {
      left: 'center',
      textStyle: {
        color: '#eee'
      }
    },
    legend: {
      bottom: 5,
      data: ['租赁'],
      itemGap: 20,
      textStyle: {
        color: '#fff',
        fontSize: 14
      },
      // selectedMode: 'single'
    },
    radar: {
      indicator: [
        { name: '图片', max: 300 },
        { name: '数字', max: 250 },
        { name: '视频', max: 300 },
        { name: '音乐', max: 5 },
        { name: '文本', max: 200 },
        { name: 'SO2', max: 100 }
      ],
      shape: 'circle',
      splitNumber: 5,
      axisName: {
        color: 'rgb(238, 197, 102)'
      },
      splitLine: {
        lineStyle: {
          color: [
            'rgba(238, 197, 102, 0.1)',
            'rgba(238, 197, 102, 0.2)',
            'rgba(238, 197, 102, 0.4)',
            'rgba(238, 197, 102, 0.6)',
            'rgba(238, 197, 102, 0.8)',
            'rgba(238, 197, 102, 1)'
          ].reverse()
        }
      },
      splitArea: {
        show: false
      },
      axisLine: {
        lineStyle: {
          color: 'rgba(238, 197, 102, 0.5)'
        }
      }
    },
    series: [
      {
        // name: '各比率',
        type: 'radar',
        data: [
          [55, 9, 56, 0.46, 18, 6, 1],
          [25, 11, 21, 0.65, 34, 9, 2],
          [56, 7, 63, 0.3, 14, 5, 3],
          [33, 7, 29, 0.33, 16, 6, 4],
          [42, 24, 44, 0.76, 40, 16, 5],
          [82, 58, 90, 1.77, 68, 33, 6],
          [74, 49, 77, 1.46, 48, 27, 7],
          [78, 55, 80, 1.29, 59, 29, 8],
          [267, 216, 280, 4.8, 108, 64, 9],
          [185, 127, 216, 2.52, 61, 27, 10],
          [39, 19, 38, 0.57, 31, 15, 11],
          [41, 11, 40, 0.43, 21, 7, 12],
          [64, 38, 74, 1.04, 46, 22, 13],
          [108, 79, 120, 1.7, 75, 41, 14],
          [108, 63, 116, 1.48, 44, 26, 15],
          [33, 6, 29, 0.34, 13, 5, 16],
          [94, 66, 110, 1.54, 62, 31, 17],
          [186, 142, 192, 3.88, 93, 79, 18],
          [57, 31, 54, 0.96, 32, 14, 19],
          [22, 8, 17, 0.48, 23, 10, 20],
          [39, 15, 36, 0.61, 29, 13, 21],
          [94, 69, 114, 2.08, 73, 39, 22],
          [99, 73, 110, 2.43, 76, 48, 23],
          [31, 12, 30, 0.5, 32, 16, 24],
          [42, 27, 43, 1, 53, 22, 25],
          [154, 117, 157, 3.05, 92, 58, 26],
          [234, 185, 230, 4.09, 123, 69, 27],
          [160, 120, 186, 2.77, 91, 50, 28],
          [134, 96, 165, 2.76, 83, 41, 29],
          [52, 24, 60, 1.03, 50, 21, 30],
          [46, 5, 49, 0.28, 10, 6, 31]
        ],
        lineStyle:{color: 'rgba(238, 197, 102, 0.5)'},
        symbol:'none',
        itemStyle:{
          color:'#F9713C'
        },
        areaStyle:{
          opacity:0.1
        }},
      // {
      //   name: '购买',
      //   type: 'radar',
      //   data: [
      //     [26, 37, 27, 1.163, 27, 13, 1],
      //     [85, 62, 71, 1.195, 60, 8, 2],
      //     [78, 38, 74, 1.363, 37, 7, 3],
      //     [21, 21, 36, 0.634, 40, 9, 4],
      //     [41, 42, 46, 0.915, 81, 13, 5],
      //     [56, 52, 69, 1.067, 92, 16, 6],
      //     [64, 30, 28, 0.924, 51, 2, 7],
      //     [55, 48, 74, 1.236, 75, 26, 8],
      //     [76, 85, 113, 1.237, 114, 27, 9],
      //     [91, 81, 104, 1.041, 56, 40, 10],
      //     [84, 39, 60, 0.964, 25, 11, 11],
      //     [64, 51, 101, 0.862, 58, 23, 12],
      //     [70, 69, 120, 1.198, 65, 36, 13],
      //     [77, 105, 178, 2.549, 64, 16, 14],
      //     [109, 68, 87, 0.996, 74, 29, 15],
      //     [73, 68, 97, 0.905, 51, 34, 16],
      //     [54, 27, 47, 0.592, 53, 12, 17],
      //     [51, 61, 97, 0.811, 65, 19, 18],
      //     [91, 71, 121, 1.374, 43, 18, 19],
      //     [73, 102, 182, 2.787, 44, 19, 20],
      //     [73, 50, 76, 0.717, 31, 20, 21],
      //     [84, 94, 140, 2.238, 68, 18, 22],
      //     [93, 77, 104, 1.165, 53, 7, 23],
      //     [99, 130, 227, 3.97, 55, 15, 24],
      //     [146, 84, 139, 1.094, 40, 17, 25],
      //     [113, 108, 137, 1.481, 48, 15, 26],
      //     [81, 48, 62, 1.619, 26, 3, 27],
      //     [56, 48, 68, 1.336, 37, 9, 28],
      //     [82, 92, 174, 3.29, 0, 13, 29],
      //     [106, 116, 188, 3.628, 101, 16, 30],
      //     [118, 50, 0, 1.383, 76, 11, 31]
      //   ],
      //   lineStyle:{color: 'rgba(238, 197, 102, 0.5)'},
      //   symbol:'none',
      //   itemStyle:{
      //     color:'#B3E4A1'
      //   },
      //   areaStyle:{
      //     opacity:0.05
      //   }
      // },
    ]
    // ECharts配置项结束
  };

  option && myChart.setOption(option);
  
}


//TokenView
export const initEChart2 = (chartDom2: HTMLElement) => {
// type EChartsOption2 = echarts.EChartsOption;

// var chartDom2 = document.getElementById('main')!;
var myChart2 = echarts.init(chartDom2);
var option2: EChartsOption;

option2 = {
  title: {
    // text: 'Stacked Line'
  },
  tooltip: {
    trigger: 'axis'
  },
  legend: {
    textStyle:{
        color:'white'
    },
    data: ['图片', '文本', '音频', '数字'],
    top:'4%',
    left:'2%'
  },
  grid: {
    left: '3%',
    right: '4%',
    bottom: '3%',
    top:'30%',
    containLabel: true
  },
  toolbox: {
    left:'90%',
    top:'10%',
    feature: {
      saveAsImage: {}
    }
  },
  xAxis: {axisLabel: {
    // 调整 X 轴标签的文本样式
    color: 'white' ,
  },
    type: 'category',
    boundaryGap: false,
    data: ['周一', '周二', '周三', '周四', '周五', '周六', '周日']
  },
  yAxis: {axisLabel: {
    // 调整 X 轴标签的文本样式
    color: 'white' ,
  },
    type: 'value'
  },
  series: [
    {
      name: '图片',
      type: 'line',
      stack: 'Total',
      data: [120, 132, 101, 134, 90, 230, 210]
    },
    {
      name: '音频',
      type: 'line',
      stack: 'Total',
      data: [220, 182, 191, 234, 290, 330, 310]
    },
    {
      name: '数字',
      type: 'line',
      stack: 'Total',
      data: [150, 232, 201, 154, 190, 330, 410]
    },
    {
      name: '文本',
      type: 'line',
      stack: 'Total',
      data: [320, 332, 301, 334, 390, 330, 320]
    },
    // {
    //   name: '视频',
    //   type: 'line',
    //   stack: 'Total',
    //   data: [820, 932, 901, 934, 1290, 1330, 1320]
    // }
  ]
};

myChart2.setOption(option2);}

//Youxia1
export function initEChart3(chartDom3:HTMLElement){
  const myChart3 = echarts.init(chartDom3);

// 数据准备
// 先获取当前日期
const currentDate = new Date();

// 计算最近20天的日期
const data = [];
for (let i = 19; i >= 0; i--) {
  const date = new Date(currentDate.getTime() - i * 24 * 60 * 60 * 1000); // 每天的毫秒数
  const formattedDate = [
    date.getFullYear(),
    (date.getMonth() + 1).toString().padStart(2, '0'), // 月份加1后，转换为两位数字符串
    date.getDate().toString().padStart(2, '0') // 转换为两位数字符串
  ].join('-');
  // 假设值使用随机数，您可以根据需要替换
  const value = Math.floor(Math.random() * (150 - 50 + 1)) + 50; // 随机数，假设在50到150之间
  data.push([formattedDate, value]);
}

const dateList = data.map(item => item[0]);
const valueList = data.map(item => item[1]);

const option3: echarts.EChartsOption = {
  visualMap: [
    {
      show: false,
      type: 'continuous',
      seriesIndex: 0,
      min: 0,
      max: 400
    },
  ],
  title: [
    {
      left: 'center',
      top:'4%',
      text: '代币价格趋势',
      textStyle:{
        color:'white'
      }
    },
  ],toolbox:{
    left:'83%',
    top:'5%',
    feature:{
      saveAsImage:{}
    }
  },
  tooltip: {
    trigger: 'axis',
  },
  xAxis: [
    {
      data: dateList,
      axisLabel: {
        // 调整 X 轴标签的文本样式
        color: 'white' ,
      },
      axisLine: {
        // 设置 X 轴线的样式
        lineStyle: {
          color: '#ffffff' // 将 X 轴线颜色设置为白色
        }
      },
    },
    
  ],
  yAxis: {
    axisLabel: {
        // 调整 X 轴标签的文本样式
        color: 'white' 
      }
  },
  grid: {bottom:'10%',
         top:'20%'},
  series: [
    {
      type: 'line',
      showSymbol: false,
      data: valueList,
      areaStyle: { 
        // 开启区域填充样式(用于生成山峰图效果)
        normal: {
          // 设置渐变色
          color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [
            {offset: 0, color: 'rgba(10, 193, 199, 0.8)'}, // 曲线图顶部颜色
            {offset: 1, color: 'rgba(255, 255, 255, 0)'}  // 曲线图底部颜色
          ])
        }
      },
      lineStyle: {
        width: 1,
        color: 'rgba(0, 176, 255, 1)' // 线的颜色
      }
    }
  ]
};

myChart3.setOption(option3);
}


export const initEChartBig = (chartDomBig: HTMLElement) =>{
const myChartBig = echarts.init(chartDomBig);


const xAxisData = [];
const currentDate = new Date();
const oneDay = 24 * 60 * 60 * 1000; // 一天的毫秒数

// 计算过去大约30天的日期
for (let i = 29; i >= 0; i--) {
  let pastDate = new Date(currentDate.getTime() - i * oneDay);
  // 使用月份+1，并且将月份和天数格式化为两位数
  let formattedDate = (pastDate.getMonth() + 1).toString().padStart(2, '0') + '-' + pastDate.getDate().toString().padStart(2, '0');
  xAxisData.push(formattedDate); // 使用 push 将日期添加到数组的末尾
}

// 假设数据1和数据2是与日期对应的值数组
const data1 = []; // 示例数据数组1
const data2 = []; // 示例数据数组2
for (let i = 0; i < xAxisData.length; i++) {
  // 生成随机数据或者根据你的数据计算公式生成数据
  data1.push(Math.round(Math.random() * 100));
  data2.push(Math.round(Math.random() * 100));
}
const option : echarts.EChartsOption = {
  title: {
    text: '层级确权比例',
    top:'4%',
    textStyle:{
      color:'white',
      position:'insideBottomLeft'
    }
  },
  legend: {
    data: ['一级确权', '二级确权'],
    top:'4%',
    textStyle:{
      color:'white'
    }
  },
  toolbox: {
    // y: 'bottom',
    feature: {
      magicType: {
        type: ['stack']
      },
      dataView: {},
      saveAsImage: {
        pixelRatio: 2
      }
    }
  },
  tooltip: {},
  xAxis: {
    data: xAxisData,
    splitLine: {
      show: false
    },
    axisLabel: {
        // 调整 X 轴标签的文本样式
        color: 'white' ,
      },
    
  },
  yAxis: {
    axisLabel: {
      // 调整 X 轴标签的文本样式
      color: 'white' ,
    },
  },
  grid:{
      left:'10%',
      right:'2%',
      bottom:'15%'
  },
  series: [
    {
      name: '一级确权',
      type: 'bar',
      data: data1,
      emphasis: {
        focus: 'series'
      },
      animationDelay: function (idx) {
        return idx * 10;
      }
    },
    {
      name: '二级确权',
      type: 'bar',
      data: data2,
      emphasis: {
        focus: 'series'
      },
      animationDelay: function (idx) {
        return idx * 10 + 100;
      },
      
    }
  ],
  animationEasing: 'elasticOut',
  animationDelayUpdate: function (idx) {
    return idx * 5;
  }
};

myChartBig.setOption(option);
}